Repository: Leviidev/Husk
Catalog: src/app/Husk/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Runs Android games straight on your iPhone, without starting Android. Add an APK, or a bundle (.xapk, .apkm, .apks) — or pick a base APK and its split pieces together. Husk keeps its own copy, apart from Android's.
zh_hans: 无需启动 Android，直接在 iPhone 上运行 Android 游戏。添加一个 APK，或一个捆绑包（.xapk、.apkm、.apks）——也可以一次选中基础 APK 及其分片。Husk 会保留自己的副本，与 Android 的分开。

source: Save Android
zh_hans: 保存 Android

source: Save Android to keep it past this session.
zh_hans: 保存 Android，它才能留存到本次会话之后。

source: Save automatically
zh_hans: 自动保存

source: Save now
zh_hans: 立即保存

source: Saved machine
zh_hans: 已保存的机器

source: Saves the machine once Android settles, so later launches restore in seconds instead of booting.
zh_hans: 等 Android 稳定后保存机器，之后启动只需几秒恢复，而无需重新引导。

source: Saves, settings and caches the game made here are deleted.
zh_hans: 游戏在此产生的存档、设置和缓存都会被删除。

source: Saving Android — the screen will freeze briefly
zh_hans: 正在保存 Android — 画面会短暂冻结

source: Saving closes apps but leaves Android's framework running, so the network still works after a restore.
zh_hans: 保存会关闭应用，但让 Android 框架继续运行，因此恢复后网络仍然可用。

source: Saving stops the framework too. Clears every GPU resource, which is steadier — but the network may not come back until a cold boot.
zh_hans: 保存时连框架也一并停止。这会清空所有 GPU 资源，因此更稳定——但网络可能要等到冷启动才会恢复。

source: Saving…
zh_hans: 正在保存…

source: Screen
zh_hans: 屏幕

source: Screenshots
zh_hans: 截图

source: Search %lld apps
zh_hans: 搜索 %lld 个应用

source: Search apps
zh_hans: 搜索应用

source: Search to see %lld more apps.
zh_hans: 搜索可查看另外 %lld 个应用。

source: Sending %@ — %lld%%
zh_hans: 正在发送 %@ — %lld%%

source: Sending %@…
zh_hans: 正在发送 %@…

source: Set Up StikJIT Now
zh_hans: 立即设置 StikJIT

source: Set up JIT
zh_hans: 设置 JIT

source: Settings
zh_hans: 设置

source: Settings › Privacy & Security › Developer Mode
zh_hans: 设置 › 隐私与安全性 › 开发者模式

source: Show
zh_hans: 显示

source: Show Android
zh_hans: 显示 Android

source: Show in Android Settings
zh_hans: 在 Android 设置中显示

source: Sideloading
zh_hans: 侧载

source: Size
zh_hans: 大小

source: Small — 360 × 800
zh_hans: 小 — 360 × 800

source: Software machine
zh_hans: 软件机器

source: Something went wrong
zh_hans: 出了点问题

source: Sound
zh_hans: 声音

source: Source URL
zh_hans: 源 URL

source: Star the repo if you like this sort of thing
zh_hans: 喜欢的话就给仓库点个星

source: Start
zh_hans: 启动

source: Start Android on launch
zh_hans: 启动时开启 Android

source: Start pairing
zh_hans: 开始配对

source: Start using Husk
zh_hans: 开始使用 Husk

source: Starting
zh_hans: 正在启动

source: Starting Android
zh_hans: 正在启动 Android

source: Starting Android…
zh_hans: 正在启动 Android…

source: Starting Husk's JIT helper…
zh_hans: 正在启动 Husk 的 JIT 辅助程序…

source: Starting attempt...
zh_hans: 正在开始尝试…

source: Starting…
zh_hans: 正在启动…

source: StikDebug is installed, so Husk will open it to turn JIT on.
zh_hans: StikDebug 已安装，Husk 会打开它来开启 JIT。

source: StikDebug is installed, so Husk will open it.
zh_hans: StikDebug 已安装，Husk 会打开它。

source: StikDebug is not installed. Install it, or set up Built-in StikJIT.
zh_hans: 未安装 StikDebug。请安装它，或设置内置 StikJIT。

source: StikDebug, TrollStore and a jailbreak were not found, so Husk will use its built-in helper.
zh_hans: 未找到 StikDebug、TrollStore 和越狱，因此 Husk 将使用内置辅助程序。

source: StikJIT is built into Husk. You can turn JIT on right here — no computer and no other app. Games and Android both need it.
zh_hans: StikJIT 已内置于 Husk。你可以在这里直接开启 JIT——无需电脑，也无需其他应用。游戏和 Android 都需要它。

source: Stop
zh_hans: 停止

source: Storage
zh_hans: 存储

source: Success: The guest drew frames!
zh_hans: 成功：客户机绘制出了画面！

source: System
zh_hans: 跟随系统

source: System follows the phone: light by day, dark by night. The guest's own screen stays dark either way — it is a picture of another phone.
zh_hans: 「跟随系统」随手机变化：白天浅色，夜晚深色。无论哪种，客户机自己的屏幕都保持深色——那只是另一台手机的画面。

source: Tablet — 1280 × 800
zh_hans: 平板 — 1280 × 800

source: Tap with three fingers to show the interface
zh_hans: 三指轻点可显示界面

source: Teaching an iPhone to speak Android
zh_hans: 教 iPhone 说 Android 语

source: Technical detail in the Android Translation Layer screens: library reports, device checks and run logs.
zh_hans: 翻译层各界面中的技术细节：库报告、设备检查和运行日志。

source: That bundle uses a zip format (Zip64) Husk does not read yet.
zh_hans: 该捆绑包使用了 Husk 尚不支持的 zip 格式（Zip64）。

source: That file is not a bundle Husk can read.
zh_hans: 该文件不是 Husk 能读取的捆绑包。

source: That is not a remote pairing file. Make one with the StikDebug pairing-file guide and try again.
zh_hans: 这不是远程配对文件。请按 StikDebug 的配对文件指南生成一个，然后重试。

source: The debugger is attached but is not answering trap requests, and this device will not execute a MAP_JIT mapping either, so no executable memory could be claimed. This is what happens when Husk runs inside another container app rather than sideloaded on its own.
zh_hans: 调试器已附加，但不响应陷阱请求，而这台设备也不执行 MAP_JIT 映射，因此无法取得可执行内存。当 Husk 运行在另一个容器应用内、而不是独立侧载时，就会出现这种情况。

source: The downloaded image did not match the release. Tap to retry.
zh_hans: 下载的镜像与发布版本不符。轻点重试。

source: The game exited
zh_hans: 游戏已退出

source: The game is loaded in this session. Close Husk completely and open it again to reset its data.
zh_hans: 游戏已在本次会话中加载。请完全关闭 Husk 再打开，才能重置它的数据。

source: The game starts with nothing over it: no bar, no controller, no readout, the picture to every edge. Tap with three fingers at once to bring the bar back, and again to hide it. The Hide button in the bar does the same while playing, but leaves the strip the bar sat in.
zh_hans: 游戏启动时画面上什么都没有：没有工具条，没有控制器，没有读数，画面铺满每一个边缘。三指同时轻点可唤回工具条，再点一次收起。游戏过程中工具条上的「隐藏」按钮效果相同，但会留下工具条所占的那一条区域。

source: The helper did not attach within 90 seconds. Check that LocalDevVPN is connected, then try again.
zh_hans: 辅助程序在 90 秒内没有附加。请确认 LocalDevVPN 已连接，然后重试。

source: The language Husk is drawn in. Android and the apps inside it keep their own, chosen in Android's settings.
zh_hans: Husk 界面所用的语言。Android 和其中的应用有各自的语言，在 Android 的设置里选择。

source: The list is written to disk, so it is on screen before Android has finished starting.
zh_hans: 这份列表已写入磁盘，因此在 Android 启动完成之前就能显示出来。

source: The pairing file stays in Husk's Documents folder and is only sent to Husk's own helper.
zh_hans: 配对文件保存在 Husk 的「文档」文件夹中，只会发送给 Husk 自己的辅助程序。

source: The panel is built when the machine starts, so a change costs one cold boot, and the next save replaces the machine saved at the old size — changing back costs another. Sizes are rounded to a multiple of eight. Bigger is slower: every pixel is drawn by an emulated phone. Android's density does not change with the panel, so a larger one shows more rather than bigger.
zh_hans: 屏幕在机器启动时构建，因此每次更改都要付出一次冷启动的代价，而下一次保存会替换掉以旧尺寸保存的机器——改回去又要再一次。尺寸会取整到 8 的倍数。越大越慢：每个像素都由模拟的手机绘制。Android 的密度不随屏幕变化，所以更大的屏幕显示的是更多内容，而不是更大的画面。

source: The plan, in order, is docs/04-translation-layer.md in Husk's source.
zh_hans: 按顺序推进的计划写在 Husk 源码的 docs/04-translation-layer.md 中。

source: The request for Husk's JIT helper could not be encoded.
zh_hans: 发给 Husk JIT 辅助程序的请求无法编码。

source: The runtime on disk is not a valid image (%@). Tap to retry.
zh_hans: 磁盘上的运行环境不是有效镜像（%@）。轻点重试。

source: The snapshot did not match the release (sha256 %@, expected %@).
zh_hans: 快照与发布版本不符（sha256 %@，应为 %@）。

source: Theme
zh_hans: 主题

source: There are no APKs in that bundle.
zh_hans: 该捆绑包里没有 APK。

source: There is no screen to show the file picker on.
zh_hans: 没有可用于显示文件选择器的屏幕。

source: They go to %@. Unmodified APKs install from here too.
zh_hans: 它们会放入 %@。未经修改的 APK 也可以从这里安装。

source: This device closed the connection, which usually means it no longer accepts Husk's pairing. Pair again, and check that LocalDevVPN is connected.
zh_hans: 这台设备断开了连接，通常意味着它不再接受 Husk 的配对。请重新配对，并确认 LocalDevVPN 已连接。

source: This device is jailbroken, so JIT comes from the jailbreak's Allow JIT in Apps setting.
zh_hans: 这台设备已越狱，因此 JIT 来自越狱设置中的「允许应用使用 JIT」。

source: This iPhone
zh_hans: 此 iPhone

source: This installation can only wait about 30 seconds in the background, so go to Settings straight away.
zh_hans: 这次安装在后台只能等待约 30 秒，请立刻前往「设置」。

source: This is a whole operating system — be patient
zh_hans: 这是一整套操作系统——请耐心等待

source: Tinted Dark
zh_hans: 色调化深色

source: Tinted Light
zh_hans: 色调化浅色

source: Tints buttons, switches and selected states throughout the app.
zh_hans: 为整个应用中的按钮、开关和选中状态着色。

source: Today, %@
zh_hans: 今天 %@

source: Tools
zh_hans: 工具

source: Touch always works. A gamepad and a pointer are not wired through to Android yet.
zh_hans: 触摸始终可用。手柄和指针目前还没有接入 Android。

source: Touch is always on. The keyboard and the rotate control are in the pill at the bottom of the guest's screen; a gamepad and a pointer are not wired through yet.
zh_hans: 触摸始终开启。键盘和旋转控制在客户机屏幕底部的胶囊条里；手柄和指针目前还没有接入。

source: Translating arm64, one block at a time
zh_hans: 逐块翻译 arm64

source: Translation Layer
zh_hans: 翻译层

source: TrollStore can turn JIT on for Husk: it opens Husk and enables it, with no computer. In TrollStore's Settings, URL Scheme must be on.
zh_hans: TrollStore 可以为 Husk 开启 JIT：它会打开 Husk 并启用 JIT，无需电脑。TrollStore 的设置中必须打开「URL Scheme」。

source: TrollStore could not be opened. Install Husk through TrollStore, or choose another method.
zh_hans: 无法打开 TrollStore。请通过 TrollStore 安装 Husk，或选择其他方式。

source: TrollStore did not enable JIT. In TrollStore's Settings turn on URL Scheme, and make sure Husk was installed through TrollStore (or is signed with get-task-allow).
zh_hans: TrollStore 没有启用 JIT。请在 TrollStore 的设置中打开「URL Scheme」，并确认 Husk 是通过 TrollStore 安装的（或以 get-task-allow 签名）。

source: TrollStore is installed, so Husk will ask it to enable JIT.
zh_hans: TrollStore 已安装，Husk 会请它启用 JIT。

source: TrollStore was not found on this %@. Husk can only use it once it is installed and Husk was installed through it.
zh_hans: 在这台 %@ 上未找到 TrollStore。只有安装了它、并且 Husk 是通过它安装的，Husk 才能使用它。

source: Try again
zh_hans: 重试

source: Turn On JIT
zh_hans: 开启 JIT

source: Turn On JIT with StikDebug
zh_hans: 用 StikDebug 开启 JIT

source: Turn On JIT with StikJIT
zh_hans: 用 StikJIT 开启 JIT

source: Turn On JIT with TrollStore
zh_hans: 用 TrollStore 开启 JIT

source: Turn on Allow JIT in Apps in Dopamine's settings, then open Husk again.
zh_hans: 请在 Dopamine 的设置中打开「允许应用使用 JIT」，然后重新打开 Husk。

source: Turn on JIT
zh_hans: 开启 JIT

source: Turn on JIT first. Close the game with Close at the top.
zh_hans: 请先开启 JIT。用顶部的「关闭」结束游戏。

source: Turning on JIT…
zh_hans: 正在开启 JIT…

source: Uninstall
zh_hans: 卸载

source: Uninstall %@?
zh_hans: 卸载 %@？

source: Uninstalled
zh_hans: 已卸载

source: Unity, cocos2d-x, Minecraft and SDL3 games
zh_hans: Unity、cocos2d-x、Minecraft 和 SDL3 游戏

source: Unpacking the guest
zh_hans: 正在解包客户机

source: Unrecognized source format
zh_hans: 无法识别的源格式

source: Unrotate picture
zh_hans: 取消旋转画面

source: Use Husk while it starts
zh_hans: 启动期间先使用 Husk

source: Use StikDebug
zh_hans: 使用 StikDebug

source: Use TrollStore
zh_hans: 使用 TrollStore

source: Use the jailbreak
zh_hans: 使用越狱

source: Version
zh_hans: 版本

source: Version %@
zh_hans: 版本 %@

source: Version %@ · %@
zh_hans: 版本 %@ · %@

source: Vibrate on a press
zh_hans: 按下时振动

source: View logs
zh_hans: 查看日志

source: Waiting for Android (%llds)…
zh_hans: 正在等待 Android（%lld 秒）…

source: Waiting for TrollStore to enable JIT…
zh_hans: 正在等待 TrollStore 启用 JIT…

source: Waiting for the helper to attach…
zh_hans: 正在等待辅助程序附加…

source: Waiting for your %@…
zh_hans: 正在等待你的 %@…

source: Waking Android up
zh_hans: 正在唤醒 Android

source: What it is
zh_hans: 这是什么

source: What the game is called in Husk. The game itself is not changed.
zh_hans: 游戏在 Husk 里显示的名称。游戏本身不会被改动。

source: Where it stands
zh_hans: 目前进展

source: Which saved machine?
zh_hans: 哪一台已保存的机器？

source: Width
zh_hans: 宽度

source: Without it Android boots from cold, which takes several minutes. The download is %@, and it replaces what is inside Android now, including installed apps.
zh_hans: 没有它，Android 就要冷启动，需要好几分钟。下载量为 %@，并会替换 Android 内当前的全部内容，包括已安装的应用。

source: Working…
zh_hans: 正在处理…

source: Yesterday, %@
zh_hans: 昨天 %@

source: Your apps are here; start it to open them.
zh_hans: 你的应用都在这里；启动后即可打开。

source: about %lld minutes remaining
zh_hans: 约剩 %lld 分钟

source: about %lld seconds remaining
zh_hans: 约剩 %lld 秒

source: answering
zh_hans: 已响应

source: attached
zh_hans: 已附加

source: detached
zh_hans: 已分离

source: executes
zh_hans: 可执行

source: file imported
zh_hans: 已导入文件

source: first boot takes 5–15 min
zh_hans: 首次启动需要 5–15 分钟

source: found; Allow JIT in Apps is off
zh_hans: 已找到；「允许应用使用 JIT」已关闭

source: granted
zh_hans: 已获得

source: iOS did not provide the extension API Husk's JIT helper needs.
zh_hans: iOS 没有提供 Husk 的 JIT 辅助程序所需的扩展 API。

source: iOS stopped Husk in the background before pairing finished. Try again, and pair from Settings straight away.
zh_hans: 配对完成前 iOS 已在后台停止了 Husk。请重试，并立即从「设置」进行配对。

source: iOS stopped the pairing in the background. Try again.
zh_hans: iOS 已在后台停止了配对。请重试。

source: installed
zh_hans: 已安装

source: no
zh_hans: 否

source: none
zh_hans: 无

source: not answering
zh_hans: 未响应

source: not attached
zh_hans: 未附加

source: not claimed
zh_hans: 未获取

source: not found
zh_hans: 未找到

source: not set up
zh_hans: 未设置

source: not started
zh_hans: 未启动

source: not tested
zh_hans: 未测试

source: not used (TXM)
zh_hans: 未使用（TXM）

source: nothing
zh_hans: 无

source: paired on this device
zh_hans: 已在本机配对

source: refused
zh_hans: 被拒绝

source: software
zh_hans: 软件

source: starting
zh_hans: 正在启动

source: tap to show
zh_hans: 轻点显示

source: the Android shell is not answering
zh_hans: Android shell 没有响应

source: the request was cancelled
zh_hans: 请求已取消

source: this %@
zh_hans: 这台 %@

source: working
zh_hans: 可用

source: yes
zh_hans: 是
